# Tukey-Kramer
# 対応なし

# 得点データ
score=c(301, 311, 325, 291, 388, 402, 325, 361, 287, 261, 238, 362, 197, 180, 178, 260, 247, 199, 179, 134, 163, 200, 209, 331, 192, 155, 234, 290, 175, 116, 285, 216, 237, 301, 343, 247, 316, 395, 324, 138, 245, 228, 214, 374, 235, 225, 214, 269, 388, 375, 224, 177, 262, 319, 247, 125, 184, 135, 258, 408, 314, 325, 347, 335, 285, 345, 257, 325, 344, 238, 352)

# グループデータ（12, 10,,,はサンプルサイズ）
group=factor(rep(c("A", "B", "C", "D", "E", "F"), c(12, 10, 12, 11, 14, 12)))

# 検定
# あらかじめバートレット検定等によって等分散性を仮定できるかどうかの検定をしておく
result <- TukeyHSD(aov(score ~ group))

# グラフにしてみる
# plot(TukeyHSD(aov(score ~ group)))